<template>
  <div class="text-structure ">
    <ul>
        <li v-for="item in list" :key="item.name" class="fw-bold">
            <span class="text-structure__name">
                {{ item.name }}
            </span> - 
            {{ item.text }}
        </li>
    </ul>
  </div>
</template>

<script setup>

const list = [
    {
        name: 'Супервайзер',
        text: 'Безусловно, перспективное планирование предоставляет широкие возможности для соответствующих условий активизации.'
    },
    {
        name: 'Председатель',
        text: 'Не следует, однако, забывать, что постоянное информационно-пропагандистское обеспечение нашей деятельности не даёт нам иного выбора, кроме определения прогресса профессионального сообщества.'
    },
    {
        name: 'Управление',
        text: 'В частности, экономическая повестка сегодняшнего дня представляет собой интересный эксперимент проверки модели развития.'
    },
    {
        name: 'Экспертный совет',
        text: 'Ясность нашей позиции очевидна: повышение уровня гражданского сознания прекрасно подходит для реализации переосмысления внешнеэкономических политик.'
    },
    {
        name: 'Исполнительный офис',
        text: 'В своём стремлении улучшить пользовательский опыт мы упускаем, что элементы политического процесса лишь добавляют фракционных разногласий и функционально разнесены на независимые элементы.'
    }
]

</script>

<style lang="scss">

.text-structure {
    text-align: start;
    font-size: 1.5rem;
    font-weight: bold;

    &__name {
        text-decoration-line: underline;
    }

    
}

</style>