<script>
  export default {
    name: "PageNews",
    // props: ['news_'],
    data() {
      return{
        id: this.$route.params.Pid,
        title: 'details',
        news: [
    {
        id: 1,
        title: 'Название новости',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },
    {
      id: 2,
        title: 'Название новости',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },
    {
      id: 3,
        title: 'Хэллоуин',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },
    {
      id: 4,
        title: 'Новый год',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },{
      id: 5,
        title: 'Посвящение',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },
    {
      id: 6,
        title: 'День Бурятской культуры',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '17.06.2023'
    },
    {
      id: 7,
        title: 'Название новости',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.11.2022'
    },
    {
      id: 8,
        title: 'Название новости',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    }
      ]
      }
    },
    methods: {
      // printDetails(data) {
      //   console.log(data)
      // }
    }
  }

// import { defineProps, defineEmits, watch, ref } from 'vue';



// defineProps({
//   news: Object,
//   default: () => {
//     return ({})
//   }
// }
// )

// const emit = defineEmits(['viewDetails'])

// // const value = ref(modelValue);

// // watch(value, () => {
// //   emits('update:modelValue', value)
// // })

// const news = {
//         title: 'Название новости',
//         img: 'dbk',
//         description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
//         date: '2.10.2022'
//     }

</script>

<template>
  <div class="page-news" >
    <div v-for="item in news" :key="item.id">
    <div v-if="id == item.id">
       <div class="page-news__title">
        {{ item.title }}
      </div>
      <div class="page-news__img">
        <img :src="`/examples/${item.img}.jpg`" alt="">

     </div>
     <div class="page-news__description">
      {{ item.description }}
     </div>
     <div class="page-news__date">
      {{ item.date }}
     </div>
    </div>
    </div>
     
  </div>
</template>

<style lang="scss">
@import '../../assets/scss/styles.scss';

.page-news {

  &__img img {
    width: 300px;
  }
}



</style>