<script >
import CardNews from '../Global/CardNews.vue';
export default {
  name: "NewsPage",
  components: {
    CardNews
  },
  props: {},
  data(){
    return {
      news: [
    {
        id: 1,
        title: 'Посвящение',
        img: 'posvat',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },
    {
      id: 2,
        title: 'Экскурсии',
        img: 'eks',
        description: '"В 2022 году в ДВФУ поступило рекордное количество первокурсников и далеко не все успели посетить самые красочные и запоминающиеся места Владивостока. Именно поэтому специально для первокурсников БСО «Элинсэг» провело экскурсию по достопримечательностям и историческим местам города у моря. За 6 часов экскурсанты посетили 9 локаций: фуникулёр, набережную Цесаревича, Старый Дворик ГУМа, Площадь Борцов Революции, Морской Вокзал Владивостока, Арбат, Сквер Городов-побратимов, Миллионку, и Спортивную Набережную. В разделе ""Мероприятия"" сообщества ВКонтакте участники смогли проголосовать за удобное для тебя время начала экускурсии. Также был доступен чат ВК, где провожающие  поддерживали связь с экскурсантами."',
        date: '23.10.2022'
    },
    {
      id: 3,
        title: 'Удэшын амаралта',
        img: 'hallowen',
        description: '"29 октября в коворкинге Аякс прошел ""Удэшын амаралта"", где участники смогли окунуться в атмосферу героического эпоса «Гэсэр» и помогли главному герою победить силы Атай Улаана.- ""Сайн байна, эрхим зоригтой сэрэгшэд! Ами наhаяа, бэеэ гамнангүй зоригтойгоор дайлалдаhан тандаа халуун баярые хүргэнэб! Танай хүсөөр, танай зоримгойhоо Алтай Улааниие илабабди! © Гэсэр"" Все испытания проходили в виде игропрактик, где гости могли насладиться высочайшим актёрским мастерством организаторов, сторителлингом о мифологии тюрко-монгольских народов и атмосферой героического эпоса. А после сокрушительной победы над злыми демонами ребята отпраздновали это боовами - бурятскими сладкими угощениями.',
        date: '29.10.2022'
    },
    {
      id: 4,
        title: 'День национальной одежды',
        img: 'dno',
        description: '"31 марта Элинсэг провели ""День Национальной Одежды"". Делегации продемонстровали свои национальные наряды и поделились ее уникальными особенностями, историей и культурным значением. Будь то красочный саронг, элегантное кимоно или потрясающее сари, всем не терпелось узнать больше о разнообразии и красоте различных национальных стилей одежды. Но это еще не все, конкурсанты соревновались за то, чтобы завоевать сердце аудитории и забрать приз. День был полнон различных интерактивов и незабываемых воспоминаний, а также был проведен розыгрыш среди учатников мероприятия. ""День Национальной Одежды"" стал возможностью открыть для себя красоту традиционной одежды и узнать больше о различных культурах!"',
        date: '31.03.2023'
    },{
      id: 5,
        title: 'Спортивное землячество',
        img: 'sport-zem',
        description: "Элинсэг пригласило жителей Владивостока на ежегодное спортивное землячество среди студентов ДВФУ, которое прошло 7 мая в ДВФУ. Гостей ждала насыщенная развлекательная программа, вкусный обед на свежем воздухе, а также времяпрепровождение в веселой компании. Во время мероприятия все участники успели пройти спортивную эстафету, поиграть волейбол, поучаствовать в викторине, а также традиционно узнать сильнейшего с помощью Бухэ Барилдаан",
        date: '07.05.2023'
    },
    {
      id: 6,
        title: 'Мисс Азия',
        img: 'miss-asia',
        description: "Традиционно Элинсэг принял участие в организации ежегодного межнационального конкурса красоты и таланта 'Мисс Азия ДВФУ - 2023' совместно с якутской студенческой организацией «Кэскил». В этом году уже на этапе кастинга свое желание выступить в конкурсе проявили студенты ДВФУ из России, Индии, Китая, Кореи, Монголии, Бурятии, Якутии и Тувы. На протяжении 2 месяцев участницы конкурса проходили через различные этапы, где они продемонстрировали свою эрудицию, умения ораторского мастерства, спортивный талант. Завершающим испытанием стал большой концерт, на котором каждая участница раскрыла свою уникальность через индивидуальный творческий номер, национальный костюм, а также общий танец.",
        date: '02.04.2023 - 26.05.2023'
    },
    {
      id: 7,
        title: 'День Бурятской Культуры',
        img: 'dbk',
        description: "В 2023 году Республика Бурятия отмечает свой 100-летний юбилей! Это стало большим поводом порадоваться за свой родной край, и поэтому 17 июня Элинсэг решил поделиться красотой и традициями родины в День Бурятской Культуры!Собравшиеся на праздничном мероприятии смогли ближе познакомиться с культурой и историей Бурятии, посмотреть на национальные наряды, попробовать бурятскую кухню, принять участие в видео-квизе, оценить свои навыки в каллиграфии и кастоме одежды, а также поиграть в национальные игры. Элинсэг считает важным показать то, что делает Бурятию такой особенной и прекрасной.",
        date: '17.06.2023'
    }
      ]
    }
  },
  computed: {},
  methods: {
      showChildId(data) {
        console.log(data)
      }
    }
}

// import CardNews from '../Global/CardNews.vue';
// import {  reactive } from 'vue';
// import { useRouter } from "vue-router";


// // const news_one = reactive({
// //   title: '',
// //   img: '',
// //   description: '',
// //   date: ''
// // })

// const router = useRouter();

// const viewDetailsClick = () => {
//   // this.$emit("viewDetails", this.product.name);

//   router.push('news');
// }

// const viewDetails = (value) => {
//   alert(value);
// }


// const news = [
//     {
//         title: 'Название новости',
//         img: 'dbk',
//         description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
//         date: '2.10.2022'
//     },
//     {
//         title: 'Название новости',
//         img: 'dbk',
//         description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
//         date: '2.10.2022'
//     },
//     {
//         title: 'Хэллоуин',
//         img: 'dbk',
//         description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
//         date: '2.10.2022'
//     },
//     {
//         title: 'Новый год',
//         img: 'dbk',
//         description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
//         date: '2.10.2022'
//     },{
//         title: 'Посвящение',
//         img: 'dbk',
//         description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
//         date: '2.10.2022'
//     },
//     {
//         title: 'День Бурятской культуры',
//         img: 'dbk',
//         description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
//         date: '17.06.2023'
//     },
//     {
//         title: 'Название новости',
//         img: 'dbk',
//         description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
//         date: '2.11.2022'
//     },
//     {
//         title: 'Название новости',
//         img: 'dbk',
//         description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
//         date: '2.10.2022'
//     }
// ]

</script>


<template>
  <div class="news-page container-xl">
    <div class="news-page__title">
      Мероприятия
    </div>
<!-- @click="viewDetailsClick"  -->
<!-- :news="item" -->
    <div class="news-page__main row w-100 d-flex justify-content-around container-xl">
        <div 
        v-for="item in news"
        :key="item.id"
       
        class="col-3 m-3">
          <CardNews 
          :news_data="item"
          @viewDetails="showChildId"
          >
            <!-- <template v-slot:img>
              <img  :src="`/examples/${item.img}.jpg`" alt="">
            </template>
            <template v-slot:title >
              {{ item.title }}
            </template>
            <template v-slot:date >
              {{ item.date }}
            </template> -->
          </CardNews>
        </div>
    </div>



  </div>
</template>


<style lang="scss">
@import '../../assets/scss/styles.scss';

.news-page {
  margin-top: 3rem;
  margin-bottom: 3rem;
  text-align: center;

  &__title {
    @include title;
  }

  &__main {
    text-align: center;

  }
    
}

.row {
  padding: 0;
  margin: 0;
}

</style>