<script setup>
import CardNews from '../Global/CardNews.vue';
import {  reactive } from 'vue';

const news_one = reactive({
  title: '',
  img: '',
  description: '',
  date: ''
})


const news = [
    {
        title: 'Название новости',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },
    {
        title: 'Название новости',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },
    {
        title: 'Хэллоуин',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },
    {
        title: 'Новый год',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },{
        title: 'Посвящение',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },
    {
        title: 'День Бурятской культуры',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '17.06.2023'
    },
    {
        title: 'Название новости',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.11.2022'
    },
    {
        title: 'Название новости',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    }
]

</script>


<template>
  <div class="news-page container-xl">
    <div class="news-page__title">
      Мероприятия
    </div>

    <div class="news-page__main row w-100 d-flex justify-content-around container-xl">
        <div 
        v-for="item in news"
        :key="item"
        class="col-3 m-3">
          <CardNews 
          v-bind:
          >
            <template v-slot:img>
              <img  :src="`/public/examples/${item.img}.jpg`" alt="">
            </template>
            <template v-slot:title >
              {{ item.title }}
            </template>
            <template v-slot:date >
              {{ item.date }}
            </template>
          </CardNews>
        </div>
    </div>



  </div>
</template>


<style lang="scss">
@import '../../assets/scss/styles.scss';

.news-page {
  margin-top: 3rem;
  margin-bottom: 3rem;
  text-align: center;

  &__title {
    @include title;
  }

  &__main {
    text-align: center;

  }
    
}

.row {
  padding: 0;
  margin: 0;
}

</style>