<script setup>
import CardNews from "../../Global/CardNews.vue"

const news = [
    {
        title: 'Название новости',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },
    {
        title: 'Название новости',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },
    {
        title: 'Название новости',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    },
    {
        title: 'Название новости',
        img: 'dbk',
        description: '"БСО ""Элинсэг"" пригласило новоиспеченных студентов на ""Посвящение в первокурсники"", где студенты отметили наступление лучших годов жизни. Посвящение прошло 2 октября в 14:00 на кругах, где ребята успешно прошли квест и получили призы. Студенты смогли познакомиться друг с другом и весело провести время."',
        date: '2.10.2022'
    }
]

</script>


<template>
  <div class="last-news-slider">
    <div class="last-news-slider__title d-flex justify-content-center">
        Последние новости
    </div>
    <div class="last-news-slider__slider d-flex justify-content-between">
        <!-- <img v-for="i in img" :key="i"
         :src="`/public/examples/${i}.jpg`" alt="" > -->

         <CardNews 
         v-for="item in news"
         :key="item"
         >
         <template v-slot:title>
             {{ item.title }}
         </template>
         <template v-slot:date>
             {{ item.date }}
         </template>
         <template v-slot:img>
             <img :src="`/examples/${item.img}.jpg`" :alt="item.img">
         </template>
         </CardNews>
     
    </div>


  </div>
</template>


<style lang="scss">
@import '../../../assets/scss/styles.scss';

.last-news-slider {

    margin-bottom: 3rem;

    &__title {
        @include title;
    }


}

</style>