<script setup>
import CardNews from "../../Global/CardNews.vue"

const news = [
    {
      id: 4,
        title: 'День национальной одежды',
        img: 'dno',
        description: '"31 марта Элинсэг провели ""День Национальной Одежды"". Делегации продемонстровали свои национальные наряды и поделились ее уникальными особенностями, историей и культурным значением. Будь то красочный саронг, элегантное кимоно или потрясающее сари, всем не терпелось узнать больше о разнообразии и красоте различных национальных стилей одежды. Но это еще не все, конкурсанты соревновались за то, чтобы завоевать сердце аудитории и забрать приз. День был полнон различных интерактивов и незабываемых воспоминаний, а также был проведен розыгрыш среди учатников мероприятия. ""День Национальной Одежды"" стал возможностью открыть для себя красоту традиционной одежды и узнать больше о различных культурах!"',
        date: '31.03.2023'
    },{
      id: 5,
        title: 'Спортивное землячество',
        img: 'sport-zem',
        description: "Элинсэг пригласило жителей Владивостока на ежегодное спортивное землячество среди студентов ДВФУ, которое прошло 7 мая в ДВФУ. Гостей ждала насыщенная развлекательная программа, вкусный обед на свежем воздухе, а также времяпрепровождение в веселой компании. Во время мероприятия все участники успели пройти спортивную эстафету, поиграть волейбол, поучаствовать в викторине, а также традиционно узнать сильнейшего с помощью Бухэ Барилдаан",
        date: '07.05.2023'
    },
    {
      id: 6,
        title: 'Мисс Азия',
        img: 'miss-asia',
        description: "Традиционно Элинсэг принял участие в организации ежегодного межнационального конкурса красоты и таланта 'Мисс Азия ДВФУ - 2023' совместно с якутской студенческой организацией «Кэскил». В этом году уже на этапе кастинга свое желание выступить в конкурсе проявили студенты ДВФУ из России, Индии, Китая, Кореи, Монголии, Бурятии, Якутии и Тувы. На протяжении 2 месяцев участницы конкурса проходили через различные этапы, где они продемонстрировали свою эрудицию, умения ораторского мастерства, спортивный талант. Завершающим испытанием стал большой концерт, на котором каждая участница раскрыла свою уникальность через индивидуальный творческий номер, национальный костюм, а также общий танец.",
        date: '02.04.2023 - 26.05.2023'
    },
    {
      id: 7,
        title: 'День Бурятской Культуры',
        img: 'dbk',
        description: "В 2023 году Республика Бурятия отмечает свой 100-летний юбилей! Это стало большим поводом порадоваться за свой родной край, и поэтому 17 июня Элинсэг решил поделиться красотой и традициями родины в День Бурятской Культуры!Собравшиеся на праздничном мероприятии смогли ближе познакомиться с культурой и историей Бурятии, посмотреть на национальные наряды, попробовать бурятскую кухню, принять участие в видео-квизе, оценить свои навыки в каллиграфии и кастоме одежды, а также поиграть в национальные игры. Элинсэг считает важным показать то, что делает Бурятию такой особенной и прекрасной.",
        date: '17.06.2023'
    }
      ]
</script>


<template>
  <div class="last-news-slider">
    <div class="last-news-slider__title d-flex justify-content-center">
        Последние новости
    </div>
    <div class="last-news-slider__slider d-flex justify-content-between">
        <!-- <img v-for="i in img" :key="i"
         :src="`/public/examples/${i}.jpg`" alt="" > -->

         <CardNews 
         v-for="item in news"
         :key="item"
          :news_data="item"
          @viewDetails="showChildId"
          >
            <!-- <template v-slot:img>
              <img  :src="`/examples/${item.img}.jpg`" alt="">
            </template>
            <template v-slot:title >
              {{ item.title }}
            </template>
            <template v-slot:date >
              {{ item.date }}
            </template> -->
          </CardNews>
     
    </div>


  </div>
</template>


<style lang="scss">
@import '../../../assets/scss/styles.scss';

.last-news-slider {

    margin-bottom: 3rem;

    &__title {
        @include title;
    }


}

</style>